<?php
// +----------------------------------------------------------------------
// | HisiPHP框架[基于ThinkPHP5开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2018 http://www.hisiphp.com
// +----------------------------------------------------------------------
// | HisiPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: 橘子俊 <364666827@qq.com>，开发者QQ群：50304283
// +----------------------------------------------------------------------
namespace app\admin\model;

use think\Model;

/**
 * 后台用户模型
 * @package app\admin\model
 */
class AdminStudenthome extends Model
{

    /**
     * 删除此表关联的信息
     * @return bool
     */
    public function delUser($uid = 0) {
        $uid = (int)$uid;
        return self::where('student_id', $uid)->delete();
    }

}
